---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireSet.Clear
source: html/9189d5a9-7297-9b63-b826-075341dd4b58.htm
---
# Autodesk.Revit.DB.Electrical.WireSet.Clear Method

Removes every item from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```